"use strict"

//Работа с массивами и псевдомассивы

// const arr = [1, 2, 3, 6, 8];
// arr[99] = 0; //так не стоит делать, нарушается смысл
// console.log(arr.length); //состоит из последнего элемента + 1
// console.log(arr);
// //Массивы для того, чтобы хранить по порядку
// //но есть исключения

//Больше всего используется for each. Проходится по каждому элементу функции
arr.forEach(function(item) {

}); //Методы - это функция



// // arr.pop(); //Удаляет последний элемент массива
// arr.push(10); //Добавление в конец массива

// console.log(arr); 

// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// for (let value of arr){
//     console.log(value);
// }